In [1]:
# Library Initializations
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from plotly.offline import download_plotlyjs, init_notebook_mode, plot, iplot
from plotly.tools import FigureFactory as FF

pd.set_option('display.max_columns', 40)

# Read data from files
# The file is stored at the same location as the notebook

data = pd.read_csv("../data/ct_rr.csv")

/home/arnab/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3020: DtypeWarning:

Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.

In [2]:
data.head()
data.dtypes

ts           object
number       object
pick_lat    float64
pick_lng    float64
drop_lat    float64
drop_lng    float64
dtype: object

In [3]:
data.number.unique()

array(['14626', '85490', '05408', ..., 63595, 27648, 37558], dtype=object)

In [4]:
## Convert None to -1
data.number.replace(" None",-1,inplace=True)

In [5]:
## Convert to number
data.number = pd.to_numeric(data.number)

In [6]:
data.dtypes

ts           object
number        int64
pick_lat    float64
pick_lng    float64
drop_lat    float64
drop_lng    float64
dtype: object

In [7]:
## data.number = data.number.apply(int)
data.head()

                    ts  number   pick_lat   pick_lng   drop_lat   drop_lng
0  2018-04-07 07:07:17   14626  12.313621  76.658195  12.287301  76.602280
1  2018-04-07 07:32:27   85490  12.943947  77.560745  12.954014  77.543770
2  2018-04-07 07:36:44    5408  12.899603  77.587300  12.934780  77.569950
3  2018-04-07 07:38:00   58940  12.918229  77.607544  12.968971  77.636375
4  2018-04-07 07:39:29    5408  12.899490  77.587270  12.934780  77.569950

In [8]:
data_new = data[['ts','number']]
data_new.head()

                    ts  number
0  2018-04-07 07:07:17   14626
1  2018-04-07 07:32:27   85490
2  2018-04-07 07:36:44    5408
3  2018-04-07 07:38:00   58940
4  2018-04-07 07:39:29    5408

In [12]:
data_new.to_csv("../data/data_new.csv",index=False)